public/writing/reflections/to-think-like-a-programmer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../writing.html">Writing</a> &gt; <a href="reflections.html">Reflections</a> &gt;
</p>
<div id="outline-container-orgada55db" class="outline-2">
<h2 id="orgada55db">To think like a programmer</h2>
<div class="outline-text-2" id="text-orgada55db">
<p>
What is that distinguishes the work / creative process of a programmer
from other sciences like physics or law?
</p>

<p>
I think a programmer works in two different worlds: a logical, formal
world made of programming langugaes, APIs complex systems that have a
clear way of working, and the real world where logic does not fully
apply (interfacing with clients, the market, governments,
power&#x2026;). The role of a programmer is to build the logical, formal
world from the needs of the non-formal real world, by utilizing both
formal and informal methods. Such process is an engineering process,
where a solution is build through iterations and trial and error.
</p>

<p>
A way of thinking that is particular to the programmer is reasoning
through interfaces and abstractions. Instead of having to understand
all the little details of a system, instead an interface exposes some
functionalities (APIs) which are the lego-blocks of the software in
the making. This is why a web programmer does not need to know how the
operating system implements networking, or how pixels are drawn to the
screen: the complicated details are abstraced away through an
interface. This is one of the most powerful tool to a programmer.
</p>

<p>
Therefore a programmer is both a logician, an engineer, and a person
able to understand and model the complexities of the world.
</p>

<p>
Some important skills to a programmer are the following:
</p>

<ul class="org-ul">
<li>being able to continuously learn new things with great speed. The
technology industry changes constantly and programmers need to build
a strong muscle to learn and learn.</li>
<li>learn by yourself by thinkering with systems. Not everything is
well-documented and well-explained (or explained at all), so the
programmer needs to become somewhat comfortable to work in alien
systems.</li>
</ul>

<hr />

<p>
Travel: <a href="reflections.html">Reflections</a>, <a href="../../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
